// 霸都丶傲天 2019年10月10日 https://github.com/AJLoveChina/birthday
var config = {
    // 句子的长度可以任意， 你可以写十句话， 二十句话都可以
    // 每句话尽量不要超过15个字,不然展示效果可能不太好
    texts: [
        "送给我",      //这里,每句话结尾的最后一个逗号必须是英文的哦!! 很重要哦!!
        "亲爱的宝贝猪猪任苏",  // 同上...
        "今天宝贝20岁啦",
        "亲亲",
        "我见过宝贝",
        "可爱的样子",
        "温柔的样子",
        "美丽的样子",
        "呆呆的样子",
        "臭美的样子",
        "玩游戏的样子",
        "我偷拍的样子",
        "奇怪的样子",
        "奇怪的样子x2",
        "怀胎十月的样子",
        "还有我们最初的样子",
        "都是我喜欢的样子",
        "对了，任苏的二十岁要",
        "更快乐",
        "更勇敢",
        "更想我",
        "生日快乐宝贝~~",
    ],
    /**
     * imgs 可以不填, 但是如果要填写的话必须遵循下面的格式
     * "对应上面的文字, 要完全一样" : "图片地址, 可以把图片放在imgs文件夹中"
     * 例如
     * "心爱的小可爱": "./imgs/xiaokeai.jpg"
     *
     * 如果不要图片的话, 直接在每行开头写两个斜杠注释即可, 例如下面的 "今天是你的生日" 的图片就不会展示了:)
     * Tip: 图片最好用正方形or接近正方形, 看起来效果更好
     */
    imgs: {
        "亲亲": "./imgs/kiss.png",
        "可爱的样子":"./imgs/cute.jpg",
        "温柔的样子":"./imgs/careful.jpeg",
        "美丽的样子":"./imgs/beau.jpg",
        "呆呆的样子":"./imgs/dai.jpg",
        "臭美的样子":"./imgs/chou.jpg",
        "玩游戏的样子":"./imgs/game.jpg",
        "我偷拍的样子":"./imgs/self.jpeg",
        "奇怪的样子":"./imgs/qi.jpg",
        "奇怪的样子x2":"./imgs/gao.jpg",
        "怀胎十月的样子":"./imgs/baby.jpg",
        "还有我们最初的样子":"./imgs/germ.jpeg",
    },
    
    // 按钮文字描述, 以下是默认的按钮文字，英文的，您可以改成你喜欢的文字
    desc: {
        turn_on: "今天是哪个小傻瓜过生日",
        play: "上音乐",
        bannar_coming: "搞点颜色",
        balloons_flying: "好像还少点东西",
        cake_fadein: "蛋糕？",
        light_candle: "蜡烛？",
        wish_message: "生日快乐宝贝～",
        story: "悄咪咪给任苏说的话"
    },

    // 结束语
    loveText: '爱你的呆呆~'
};
